infoDestinations/app/controllers/destinations_controller.rb

    def index
      @destinations = Destination.all
---
SELECT "destinations".* FROM "destinations"

    def create
      @destination = Destination.new(destination_params)
      # @date1 = JSON.parse(request.body.read)['landing_time']
      # @date2 = JSON.parse(request.body.read)['boarding_time']
      # DateTime.parse(@date1)
      # DateTime.parse(@date2)
      if @destination.save
---
INSERT INTO "destinations" ("id_destination", "name", "weather", "description", "time_zone", "landing_time", "boarding_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
      if @destination.update(destination_params)
---
UPDATE "destinations" SET "name" = ?, "updated_at" = ? WHERE "destinations"."id" = ?  [["name", "Bogota"], ["updated_at", "2019-05-20 01:58:06.720305"], ["id", 1]]

    def destroy
      if @destination.destroy
---
DELETE FROM "destinations" WHERE "destinations"."id" = ?  [["id", 3]]

      def set_destination
        @destination = Destination.find(params[:id])
---
SELECT  "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]